src/Catalogs/рнсПравилаОписанияВстроенныхДокументов/рнсПравилаОписанияВстроенныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рнсПравилаОписанияВстроенныхДокументов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Хранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипШаблона</name>
    <comment>0 - табличный документ, 1 - макет, 2 - форматированный документ, 3 - текстовый документ</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.рнсГруппыДоступаРасширенныхНастроек</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Области</name>
    <attributes>
      <name>ИмяОбласти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Родитель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Параметры</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/рнсПравилаОписанияВстроенныхДокументов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет объект данным по табличному документу
//
// Параметры:
// ТабличныйДокумент - ТабличныйДокумент - проверяемый табличный документ
//
Процедура ЗаполнитьОписаниеМакета(ТабличныйДокумент = Неопределено) Экспорт
	
	Если ТабличныйДокумент = Неопределено Тогда
		Макет = Хранилище.Получить();	
	Иначе
		Макет = ТабличныйДокумент;
	КонецЕсли; 
	
	Области.Очистить();
	Параметры.Очистить();
	
	ДобавитьОбластиТабличногоДокумента(Макет); 
	
КонецПроцедуры  

#КонецОбласти 
	
#Область ОбработчикиСобытий   

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьОписаниеМакета();	 		
	
КонецПроцедуры 

#КонецОбласти    

#Область СлужебныеПроцедурыИФункции   

Процедура ДобавитьОбластиТабличногоДокумента(ТабличныйДокумент, Индекс = 0, ИсключаемаяОбласть = "")
	
	Если ТипШаблона = 0 ИЛИ ТипШаблона = 1 Тогда 	 
	
		Для каждого Область Из ТабличныйДокумент.Области Цикл 		
			
			ИмяОбласти = Область.Имя;
			
			Если ИмяОбласти = ИсключаемаяОбласть ИЛИ Области.Найти(Область.Имя, "ИмяОбласти") <> Неопределено Тогда
				Продолжить;	
			КонецЕсли;		
			
			КлючСвязи		= Строка(Новый УникальныйИдентификатор);
			ОбластьМакета 	= ТабличныйДокумент.ПолучитьОбласть(Область.Имя);
			
			СтрокаОбласти 				= Области.Добавить();
			СтрокаОбласти.ИмяОбласти 	= ИмяОбласти;
			СтрокаОбласти.КлючСвязи		= КлючСвязи;
			СтрокаОбласти.Родитель		= Индекс;    
			
			Если Область.ТипОбласти <> ТипОбластиЯчеекТабличногоДокумента.Колонки Тогда 		 
				
				Для НомерСтроки = 1 По ОбластьМакета.ПолучитьРазмерОбластиДанныхПоВертикали() Цикл
					Для НомерКолонки = 1 По ОбластьМакета.ПолучитьРазмерОбластиДанныхПоГоризонтали() Цикл
						ТекЯчейка = ОбластьМакета.Область(НомерСтроки, НомерКолонки, НомерСтроки, НомерКолонки);
						Если ТекЯчейка.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Параметр Тогда
							СтрокаПараметра 				= Параметры.Добавить();
							СтрокаПараметра.ИмяПараметра 	= ТекЯчейка.Параметр;
							СтрокаПараметра.КлючСвязи		= КлючСвязи;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
				
			КонецЕсли;
			
			ДобавитьОбластиТабличногоДокумента(ОбластьМакета, Области.Количество(), ИмяОбласти);
			
		КонецЦикла;	
	
	КонецЕсли;
	
КонецПроцедуры   

#КонецОбласти 

#КонецЕсли
